Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་གཞན་རྣམས་ཁོང་དུ་ཆུད་པར་བགྱི་བའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་མིང་དང་མཚན་མས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་བསྟན་ཏེ། ཆོས་རྣམས་བརྗོད་པ་མཛད་ན། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་མིང་མ་མཆིས་ཤིང་མཚན་མ་མ་མཆིས་པ་ལ་ཇི་ལྟར་མིང་དང་མཚན་མས་བརྗོད་པ་མཛད།
en: Blessed Lord, if the Blessed One has revealed the reality of all phenomena and expressed [the nature of] all phenomena through names and signs so that others might comprehend it, how then, Blessed Lord, are all phenomena without names and without signs expressed through names and signs?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བརྗོད་པ་ནི་མིང་ཡང་མ་ཡིན། མཚན་མ་ཡང་མ་ཡིན། མངོན་པར་ཆགས་པ་ཡང་མ་ཡིན་ཏེ།
en: Subhūti,” replied the Blessed One, “this verbal expression is neither name nor sign, and it is indeed without fixation.

source: རབ་འབྱོར་གཞན་དུ་ན་སྡུག་བསྔལ་ཉིད་བརྗོད་པར་ཟད་དེ། མིང་དང་མཚན་མ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: Subhūti, I merely expressed the nature of suffering to others, but am without fixation on names and signs.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་འམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ནི། མིང་དང་མཚན་མ་ལ་མངོན་པར་ཆགས་པར་མི་འགྱུར་ཏེ། རབ་འབྱོར་གལ་ཏེ་མིང་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རམ། མཚན་མ་ལ་མངོན་པར་ཆགས་པར་འགྱུར་ན་ནི།
en: Subhūti, the tathāgatas or the śrāvakas of the tathāgatas are not fixated on names or signs.

source: སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ། །མཚན་མ་མེད་པ་འང་མཚན་མ་མེད་པ་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ། །སྨོན་པ་མེད་པ་འང་སྨོན་པ་མེད་པ་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ། །དེ་བཞིན་ཉིད་ཀྱང་དེ་བཞིན་ཉིད་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ། །ཡང་དག་པའི་མཐའ་ཡང་ཡང་དག་པའི་མཐའ་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ།
en: Subhūti, if they were fixated on names or fixated on signs, emptiness would also be fixated on emptiness, signlessness would also be fixated on signlessness, wishlessness would also be fixated on wishlessness, the real nature would also be fixated on the real nature, the very limit of reality would also be fixated on the very limit of reality, the realm of phenomena would also be fixated on the realm of phenomena, and the unconditioned would also be fixated on the unconditioned.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་མངོན་པར་ཆགས་པར་འགྱུར་རོ། །འདུས་མ་བྱས་ཀྱང་འདུས་མ་བྱས་ལ་མངོན་པར་ཆགས་པར་འགྱུར་ཏེ། ཆོས་འདི་དག་ཐམས་ཅད་ཀྱང་མིང་ཙམ་དུ་ཟད་པས་ན་དེ་དག་ནི་མིང་ཙམ་ལ་གནས་པ་མེད་དོ།
en: But since all these phenomena are merely words, they do not dwell upon mere words.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མིང་དང་མཚན་མ་ལ་གནས་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ། དེ་ལ་མངོན་པར་ཆགས་པར་མི་བྱའོ། །གསོལ་པ།
en: So it is, Subhūti, that bodhisattva great beings should practice the perfection of wisdom, continuing [to use] names and signs, but they should not be fixated on them.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་འདུས་བྱས་དེ་དག་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་བས་པ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གང་གི་དོན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། འདུ་བྱེད་རྣམས་དུ་མ་ཉམས་སུ་མྱོང་བར་བགྱིད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལགས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་སྦྱིན་པ་སྣ་ཚོགས་ཡོངས་སུ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་སྲུང་བ་དང་། བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་སྒོམ་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་པ་དང་།
en: Blessed Lord, if all these conditioned phenomena are merely names and signs, for what purpose do bodhisattva great beings set their minds on enlightenment, and, after setting their minds on enlightenment, experience many formative predispositions; engage in the conduct of a bodhisattva; dispense various gifts while engaging in the conduct of a bodhisattva; maintain ethical discipline; acquire tolerance; undertake perseverance; become absorbed in meditative stability; cultivate wisdom; practice all the aspects of emptiness; practice the applications of mindfulness; practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; and practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་ལགས།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་གཅིག་པ།
en: V: 124} signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་དེ་སྐད་དུ། གལ་ཏེ་འདུས་བྱས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་ཟད་ན། འོ་ན་གང་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅེས་ཟེར་བ་ནི།
en: Subhūti,” replied the Blessed One, “you have asked that if all conditioned phenomena are merely names and signs, in that case for what purpose do bodhisattva great beings engage in the conduct of a bodhisattva.

source: རབ་འབྱོར་དེ་ལྟར་འདུས་བྱས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་ཟད་དེ། མིང་ཡང་མིང་གིས་སྟོང་། མཚན་མ་ཡང་མཚན་མས་སྟོང་པས་ན།
en: In this regard, Subhūti, it is because all conditioned phenomena are merely names and signs that names are indeed empty of names, and signs are indeed empty of signs.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་སྟེ།
en: It is for this reason that bodhisattva great beings engage in the conduct of a bodhisattva and attain all-aspect omniscience; that, having attained all-aspect omniscience, they turn the wheel of the Dharma; and that, after turning the wheel of the Dharma, they bring beings to final nirvāṇa by means of the three vehicles.

source: མིང་དང་མཚན་མ་དེ་ལ་སྐྱེ་བ་དང་། འཇིག་པ་དང་། གནས་པ་དང་། གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་མི་དམིགས་སོ།
en: But in terms of these names and signs, no arising, no perishing, no abiding, and no transition can be apprehended.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་གསུང་ངམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, you speak of ‘all-aspect omniscience, all-aspect omniscience’!” “

source: རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་སྨྲའོ།
en: Subhūti, I do speak of ‘all-aspect omniscience, all-aspect omniscience’!”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་ཤེས་པ་ཉིད་དུ་གསུངས་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་མདོར་གསུངས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དེ་བཞིན་གཤེགས་པས་གསུངས་ན། བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་པ་དེ་གསུམ་ལ་ཁྱད་ནི་ཅི་ཞིག་མཆིས།
en: Blessed Lord, since the tathāgatas have spoken of knowledge of all the dharmas, spoken briefly of knowledge of the path, and also spoken of all-aspect omniscience, what, Blessed Lord, is the distinction among these three sorts of all-knowing?

source: བྱེ་བྲག་ནི་ཅི་ཞིག་མཆིས།
en: What is the difference?

source: རྣམ་པ་ནི་ཅི་ཞིག་མཆིས།
en: What are their aspects?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱ་བ་ནི། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་བྱའོ།
en: Subhūti,” replied the Blessed One, “that which is called the knowledge of all the dharmas pertains to śrāvakas and pratyekabuddhas.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་བྱའོ།
en: Knowledge of the path pertains to bodhisattva great beings.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་བྱའོ། །གསོལ་པ།
en: All-aspect omniscience pertains to the tathāgatas, arhats, completely awakened buddhas.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བགྱི།
en: Blessed Lord, why does knowledge of all the dharmas pertain to śrāvakas and pratyekabuddhas?

source: ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བགྱི།
en: Why does knowledge of the path pertain to bodhisattva great beings?” {Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཇི་ཙམ་དུ་ཕྱི་དང་ནང་གི་ཆོས་ཇི་སྙེད་པ་ཙམ་ནི་ཐམས་ཅད་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཤེས་ཏེ། ལམ་ཐམས་ཅད་དུ་ནི་མ་ཡིན་ནོ།
en: V: 125} “Subhūti,” replied the Blessed One, “the extent of all outer and inner phenomena that there are is understood by śrāvakas and pratyekabuddhas, but this does not include all the paths.

source: །རབ་འབྱོར་གང་ཡང་འདི་སྐད་དུ་ཅིའི་ཕྱིར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བྱ་ཞེས་ཟེར་བ་ནི།
en: Subhūti, you also asked why knowledge of the path pertains to bodhisattva great beings.

source: རབ་འབྱོར་ལམ་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསྒྲུབ་པར་བྱ།
en: In this regard, Subhūti, all paths should be attained by bodhisattva great beings.

source: ལམ་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་པར་བྱ་སྟེ།
en: All paths should be known by bodhisattva great beings.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ལམ་གང་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ཡིན་ལ།
en: This is because all the paths of the śrāvakas and pratyekabuddhas that there are, and all the paths of bodhisattva great beings that there are, should be completed.

source: ལམ་དེ་དག་གིས་ཀྱང་ལམ་གྱི་བྱ་བ་བྱ་དགོས་ཏེ། ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: The activities associated with the path should be carried out through those paths, but the very limit of reality is not something brought into being.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱི་འཚལ་ན། འོ་ན་ནི་དེས་ཡང་དག་པའི་མཐའ་ཡང་མངོན་དུ་བགྱི་བར་འགྱུར་རོ།
en: Blessed Lord, when bodhisattva great beings seek to complete the path of the buddhas in that manner, in that case, they would also actualize the very limit of reality!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་བྱས་ལ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མ་བྱས་པར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱའོ། །གསོལ་པ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings should not actualize the very limit of reality without having refined the buddhafields and without having brought beings to maturity.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལམ་ལ་གནས་ཏེ། ཡང་དག་པའི་མཐའ་མངོན་དུ་བགྱི་འམ།
en: Blessed Lord, should bodhisattva great beings, having been established on the path, then actualize the very limit of reality?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མ་ཡིན་ནོ། །གསོལ་པ།
en: No,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་འོ་ན་ལམ་མ་ལགས་པ་ལ་གནས་ཏེ་འམ།
en: In that case, Blessed Lord, should they do so, having been established in that which is not the path?” “

source: འོ་ན་ལམ་ཡང་ལགས་ལ། ལམ་མ་ལགས་པ་ལ་ཡང་གནས་ཏེ་འམ།
en: In that case, should they do so, having been established in both that which is the path and that which is not the path?” “

source: འོ་ན་ལམ་ཡང་མ་ལགས་ལ། ལམ་མ་ལགས་པ་ཡང་མ་ལགས་པ་ལ་གནས་ཏེ་འམ།
en: In that case, should they do so, having been established in that which is neither the path nor not the path?” “

source: བཅོམ་ལྡན་འདས་འོ་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡང་དག་པའི་མཐའ་མངོན་དུ་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: In that case, Blessed Lord, how will bodhisattva great beings actualize the very limit of reality?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ལམ་ལ་གནས་པས་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལམ།
en: Subhūti, do you think that by being established on the path you have liberated your mind from contamination, without further grasping?”

source: འོ་ན་ལམ་མ་ཡིན་པ་ལ་གནས་ཏེ་འམ།
en: In that case, have you done so by being established on that which is not the path?”

source: འོ་ན་ལམ་ཡང་ཡིན་ལ། ལམ་མ་ཡིན་པ་ལ་ཡང་གནས་ཏེ་འམ།
en: In that case, have you done so by being established on both that which is the path and that which is not the path?”

source: འོ་ན་ལམ་ཡང་མ་ཡིན་ལ། ལམ་མ་ཡིན་པ་ཡང་མ་ཡིན་པ་ལ་གནས་ཏེ། ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལམ།
en: In that case, have you liberated your mind from contamination, without further grasping, by being established in that which is neither the path nor not the path?”

source: །བཅོམ་ལྡན་འདས་བདག་གི་སེམས་ནི་གང་ལ་ཡང་གནས་པས། ཉེ་བར་ལེན་པ་མ་མཆིས་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བ་མ་མཆིས་ཏེ།
en: Blessed Lord, my mind has not been liberated from contamination, without further grasping, by being established in anything at all.

source: བཅོམ་ལྡན་འདས་བདག་གི་སེམས་ནི་གང་ལ་ཡང་མི་གནས་པས་རྣམ་པར་གྲོལ་ལོ།
en: Blessed Lord, my mind has been liberated by not being established in anything at all.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཅི་ལ་ཡང་མི་གནས་པར་ཡང་དག་པའི་མཐའ་མངོན་དུ་བྱའོ།
en: In the same way, Subhūti,” replied the Blessed One, “bodhisattva great beings should actualize the very limit of reality without being established in anything at all.” “

source: །རབ་འབྱོར་གང་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་ནི། རྣམ་པ་གཅིག་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་སྟེ།
en: As far as the expression ‘all-aspect omniscience, all-aspect omniscience’ is concerned, it is because of one single aspect that is termed all-aspect omniscience.

source: འདི་ལྟར་ཞི་བའི་རྣམ་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ། །རབ་འབྱོར་འདི་ལྟར་ཡང་རྣམ་པ་གང་དང་།
en: That is to say, it is termed all-aspect omniscience because of the aspect of peace.

source: ཚུལ་གང་དང་། མཚན་མ་གང་གིས་ཆོས་རྣམས་བརྗོད་པར་བྱ་བའི་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དེ་བཞིན་གཤེགས་པས་ཐུགས་སུ་ཆུད་པས། དེའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ།
en: Subhūti, it is also because the tathāgatas understand those aspects, principles, and signs that are the aspects, principles, and signs by which all phenomena are expressed that it is termed all-aspect omniscience. ” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བགྱི་བ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདི་གསུམ་ལས་ཉོན་མོངས་པ་སྤངས་པའི་རྣམ་པ་འདིས་ནི་ལྷག་མ་མ་ལུས་པར་སྤངས་སོ།
en: Blessed Lord, among these three sorts of all-knowing—knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience—is there a difference in the aspects of afflicted mental states that are abandoned, one through which they are abandoned without residue, and one through which they are not abandoned without residue?” “

source: །འདིས་ནི་ལྷག་མ་མ་ལུས་པར་མ་སྤངས་སོ། །ཞེས་བགྱི་བའི་བྱེ་བྲག་མཆིས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཉོན་མོངས་པ་སྤངས་པ་ལ་ནི་བྱེ་བྲག་མེད་དེ།
en: Subhūti,” replied the Blessed One, “there is no difference in their abandoning of afflicted mental states.

source: དེ་བཞིན་གཤེགས་པ་ལ་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པ་མངའོ། །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ལ་ནི། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པ་མེད་དོ།
en: However, the tathāgatas have abandoned all reincarnation through the continuity of propensities, while the śrāvakas and pratyekabuddhas have not abandoned all reincarnation through the continuity of propensities.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱིས་འདུས་མ་བགྱིས་མ་ཐོབ་པར་ཉོན་མོངས་པ་སྤངས་སམ།
en: Blessed Lord, have all those śrāvakas and pratyekabuddhas abandoned afflicted mental states without attaining the unconditioned state?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་མ་ཡིན་ནོ།
en: No,” replied the Blessed One. “

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས། འདུས་མ་བགྱིས་པ་ལ་བྱེ་བྲག་དམིགས་སུ་མཆིས་སམ།
en: Blessed Lord, are differences in the unconditioned state apprehensible?” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་དམིགས་སུ་མ་མཆིས་ན། ཅིའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་དུ་འདི་ལ་ནི། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤངས་པ་མངའོ། །འདི་ལ་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤངས་པ་མེད་དོ། །ཞེས་བཀའ་སྩལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if such [differences] are not apprehensible, why then did the Blessed One say that these have abandoned reincarnation through the continuity of propensities, but those have not abandoned reincarnation through the continuity of propensities?” “

source: རབ་འབྱོར་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ནི་ཉོན་མོངས་པ་ཡང་མ་ཡིན་མོད་ཀྱི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ལུས་ཀྱི་རྣམ་པ་དང་།
en: Subhūti,” replied the Blessed One, “as far as reincarnation through the continuity of propensities is concerned, although there are indeed no afflicted mental states, the śrāvakas and pratyekabuddhas do have physical and verbal aspects of desire, hatred, and delusion.

source: ངག་གི་རྣམ་པ་ཡོད་དེ། དེ་དག་གི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དེ་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཀུན་དང་ཐུན་མོང་དུ་གནོད་པར་འགྱུར་བ་ནི་མ་ཡིན་ཏེ།
en: The reincarnation through the propensities of these [afflicted mental states] is harmful to all simple, ordinary persons in common, but not to them.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཐམས་ཅད་དུ་ཐམས་ཅད།
en: On the other hand, the tathāgatas, arhats, completely awakened buddhas are entirely devoid of such [reincarnation through the continuity of propensities] in all respects.

source: རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་མངའ་ཞིང་མི་དམིགས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: It is not apprehended.”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ལམ་ཡང་མ་མཆིས་ལ། མྱ་ངན་ལས་འདས་པ་ཡང་མ་མཆིས་ན། འོ་ན་ཅིའི་སླད་དུ། འདི་སྐད་དུ། འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ། །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའོ། །འདི་ནི་ཕྱིར་མི་འོང་བའོ། །འདི་ནི་དགྲ་བཅོམ་པའོ། །འདི་ནི་རང་སངས་རྒྱས་སོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བཤད། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if the path is indeed nonexistent, and nirvāṇa is also nonexistent, in that case, why is it explained that this one is entering the stream to nirvāṇa, this one is destined for only one more rebirth, this one is no longer subject to rebirth, this one is an arhat, this one is a pratyekabuddha, this one is a bodhisattva great being, and this one is a tathāgata, arhat, completely awakened buddha?” “

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། འདུས་མ་བགྱིས་ཏེ། འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ། །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའོ།
en: Subhūti,” replied the Blessed One, “all these—who are said to enter the stream to nirvāṇa, to be destined for only one more rebirth, to be no longer subject to rebirth, and to be arhats, pratyekabuddhas, bodhisattva great beings, or tathāgatas, arhats, completely awakened buddhas—are indeed distinguished on the basis of the unconditioned [reality].” “

source: །འདི་ནི་ཕྱིར་མི་འོང་བའོ། འདི་ནི་དགྲ་བཅོམ་པའོ། །འདི་ནི་རང་སངས་རྒྱས་སོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བགྱི་བར་རབ་ཏུ་འབྱེད་པ་མཆིས་སམ།
en: Blessed Lord, is it the unconditioned [reality] that makes distinctions to the effect that this one is entering the stream to nirvāṇa, this one is destined for only one more rebirth, this one is no longer subject to rebirth, this one is an arhat, this one is a pratyekabuddha, this one is a bodhisattva great being, and this one is a tathāgata, arhat, completely awakened buddha?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདུས་མ་བྱས་ནི་རབ་ཏུ་འབྱེད་པ་མེད་མོད་ཀྱི། འོན་ཀྱང་ཚིག་ཚད་མར་བྱས་ཤིང་བརྗོད་དེ།
en: Subhūti,” replied the Blessed One, “the unconditioned [reality] does not at all make these distinctions, although one may speak of them, taking words as one’s standard.

source: དོན་དམ་པར་ནི་རབ་ཏུ་དབྱེ་བར་མི་ནུས་སོ།
en: Ultimately these distinctions cannot be made.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལ་ཚིག་གི་ལམ་གྱི་གདགས་པ་མེད་དེ།
en: If you ask why, in that [reality] there is no conception of verbal paths.

source: འོན་ཀྱང་གང་དང་གང་གིས་མཐའ་མ་ཆོད་པ་དེ་དང་དེ་དག་ལ་ཕྱི་མའི་མཐར་གདགས་པ་ཡིན་ཏེ།
en: Future limits are conceived with respect to those whose [past] limits have not been cut off. {Ki.

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ། སྔོན་གྱི་མཐའ་ཡང་མི་དམིགས།
en: V: 127} Subhūti, when all phenomena are empty of their own defining characteristics, past limits are not apprehended, so how could future limits be apprehended?

source: ཕྱི་མའི་མཐའ་ཡང་དམིགས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད་དེ་གནས་མེད་དོ།
en: That would be impossible!

source: །རབ་འབྱོར་སེམས་ཅན་དེ་དག་ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་མི་ཤེས་པས། དེ་དག་ལ་འདི་སྐད་དུ། འདི་ནི་སྔོན་གྱི་མཐའ་ཞེས་བྱའོ། །འདི་ནི་ཕྱི་མའི་མཐའ་ཞེས་བྱའོ། །ཞེས་བསྟན་ཏེ།
en: Subhūti, because those beings do not know that all phenomena are empty of their own defining characteristics, I have explained to them that this is the limit of past time, this is the limit of future time.

source: རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་སྔོན་གྱི་མཐའ་འམ་ཕྱི་མའི་མཐའ་དམིགས་སུ་མེད་དོ།
en: In all phenomena, which are empty of their own defining characteristics, the limit of past time or the limit of future time is nonapprehensible.

source: །རབ་འབྱོར་དེ་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་སྤྱད་ན། ནང་ངམ་ཕྱིའི་ཆོས་སམ།
en: So it is, Subhūti, that they should practice the perfection of wisdom because all phenomena are empty of their own defining characteristics.

source: འདུས་བྱས་སམ། འདུས་མ་བྱས་སམ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ། ཆོས་ཀྱི་ཆོས་གང་ལ་ཡང་མངོན་པར་ཆགས་པར་མི་འགྱུར་རོ།
en: When they engage with all phenomena that are empty of their own defining characteristics, they are not fixated on anything at all, be they inner or outer phenomena, conditioned or unconditioned phenomena, the attributes of the śrāvakas, the attributes of the pratyekabuddhas, or the attributes of the buddhas.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བགྱི་བ་འདི་ཅིའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བགྱི།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, when you speak of ‘the perfection of wisdom, the perfection of wisdom,’ for what purpose do you speak of the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དམ་པ་ཐོབ་པ་ཡིན་ཏེ། དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Subhūti,” replied the Blessed One, “this perfection of wisdom (prajñā­pāramitā) has reached the highest (parama) perfection of all phenomena, and that is why one speaks of the ‘perfection of wisdom.’

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིས། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད། ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་གྱུར།
en: Moreover, Subhūti, it is through this perfection of wisdom that śrāvakas, pratyekabuddhas, bodhisattva great beings, and the tathāgatas, arhats, completely awakened buddhas all have arrived at the transcendence (pāram), and will arrive at the transcendence, of all phenomena—and that, too, is why one speaks of the ‘perfection of wisdom.’
